In [1]:
import pandas as pd
import numpy as np

In [7]:
s1 = pd.Series(range(5,0,-1), index=['a','b','c','d','e'])
s1

a    5
b    4
c    3
d    2
e    1
dtype: int64

In [8]:
s1['d']

2

In [9]:
s1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
s1.values

array([5, 4, 3, 2, 1], dtype=int64)

In [11]:
type(s1.index)

pandas.core.indexes.base.Index

In [12]:
type(s1.values)

numpy.ndarray

In [13]:
s1.index.values

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [14]:
s1['a':'c']

a    5
b    4
c    3
dtype: int64

In [15]:
s1[s1>2]

a    5
b    4
c    3
dtype: int64

In [20]:
data = pd.Series(np.arange(1,5) * 0.25, index=list('abcd'))
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [21]:
data['b']

0.5

In [27]:
data.add_prefix('pref-').add_suffix('-suf')

pref-a-suf    0.25
pref-b-suf    0.50
pref-c-suf    0.75
pref-d-suf    1.00
dtype: float64

In [32]:
data['c'] = 2412

In [36]:
data.astype('float16')

a       0.25
b       0.50
c    2412.00
d       1.00
dtype: float16

In [38]:
data['e'] = 11
data

a    0.25
b     0.5
c    2412
d      11
e      11
dtype: object

In [39]:
data = pd.Series(np.arange(1,5) * 0.25, index=[2,5,3,7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [40]:
data[2]

0.25

In [48]:
data.index = np.arange(len(data))

In [49]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [50]:
data[0:2]

0    0.25
1    0.50
dtype: float64

In [46]:
data.index = [1,1,1,3]

In [47]:
data[1]

1    0.25
1    0.50
1    0.75
dtype: float64

In [51]:
pop_dict = {'California':   39.8,
            'Texas':        28.7,
            'Florida':      21.3,
            'New York':     19.8,
            'Pennsylvania': 12.8}

In [52]:
population = pd.Series(pop_dict)

In [53]:
population

California      39.8
Texas           28.7
Florida         21.3
New York        19.8
Pennsylvania    12.8
dtype: float64

In [55]:
population['California':'New York']

California    39.8
Texas         28.7
Florida       21.3
New York      19.8
dtype: float64

In [60]:
population.loc[('California','New York'),]

California    39.8
New York      19.8
dtype: float64

In [65]:
'California' in population.index

True

In [66]:
39.8 in population.values

True

In [73]:
my_list = list('abcdefghijklmnopqrstuwxyz')
my_arr  = np.arange(len(my_list))
abc = pd.Series(dict(zip(my_list, my_arr)))

In [74]:
abc

a     0
b     1
c     2
d     3
e     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
w    21
x    22
y    23
z    24
dtype: int64

In [75]:
abc * 2

a     0
b     2
c     4
d     6
e     8
f    10
g    12
h    14
i    16
j    18
k    20
l    22
m    24
n    26
o    28
p    30
q    32
r    34
s    36
t    38
u    40
w    42
x    44
y    46
z    48
dtype: int64

In [76]:
abc.mean()

12.0

In [78]:
abc = abc.where(abc > 4)

In [79]:
abc.isnull()

a     True
b     True
c     True
d     True
e     True
f    False
g    False
h    False
i    False
j    False
k    False
l    False
m    False
n    False
o    False
p    False
q    False
r    False
s    False
t    False
u    False
w    False
x    False
y    False
z    False
dtype: bool

In [80]:
abc.isna()

a     True
b     True
c     True
d     True
e     True
f    False
g    False
h    False
i    False
j    False
k    False
l    False
m    False
n    False
o    False
p    False
q    False
r    False
s    False
t    False
u    False
w    False
x    False
y    False
z    False
dtype: bool

In [ ]:
abc

# DataFrames

In [81]:
pop_dict

{'California': 39.8,
 'Texas': 28.7,
 'Florida': 21.3,
 'New York': 19.8,
 'Pennsylvania': 12.8}

In [82]:
area_dict = {'California': 423,
             'Texas': 695,
             'Florida': 170,
             'New York': 141,
             'Pennsylvania': 119}

In [87]:
states = pd.DataFrame({'population': pop_dict,
                       'area': area_dict})

In [88]:
states

              population  area
California          39.8   423
Florida             21.3   170
New York            19.8   141
Pennsylvania        12.8   119
Texas               28.7   695

In [89]:
states.loc['Colorado'] = pd.Series(data=[15.2, 291], index=['population','area'])

In [90]:
states

              population   area
California          39.8  423.0
Florida             21.3  170.0
New York            19.8  141.0
Pennsylvania        12.8  119.0
Texas               28.7  695.0
Colorado            15.2  291.0

In [92]:
states.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, California to Colorado
Data columns (total 2 columns):
population    6 non-null float64
area          6 non-null float64
dtypes: float64(2)
memory usage: 144.0+ bytes

In [93]:
states.describe()

       population        area
count    6.000000    6.000000
mean    22.933333  306.500000
std      9.926866  221.776239
min     12.800000  119.000000
25%     16.350000  148.250000
50%     20.550000  230.500000
75%     26.850000  390.000000
max     39.800000  695.000000

In [94]:
states.index

Index(['California', 'Florida', 'New York', 'Pennsylvania', 'Texas',
       'Colorado'],
      dtype='object')

In [95]:
states.columns

Index(['population', 'area'], dtype='object')

In [96]:
states.itertuples()

In [98]:
population.to_frame(name='population')

              population
California          39.8
Texas               28.7
Florida             21.3
New York            19.8
Pennsylvania        12.8

In [99]:
pd.DataFrame(population, columns=['population'])

              population
California          39.8
Texas               28.7
Florida             21.3
New York            19.8
Pennsylvania        12.8

In [101]:
test = pd.DataFrame(
    np.arange(100).reshape(10,10), columns=list('abcdefghij'))

In [102]:
test

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [104]:
test.drop(columns=['d', 'i']).assign(d=test['d'], i=test['i'])

    a   b   c   e   f   g   h   j   d   i
0   0   1   2   4   5   6   7   9   3   8
1  10  11  12  14  15  16  17  19  13  18
2  20  21  22  24  25  26  27  29  23  28
3  30  31  32  34  35  36  37  39  33  38
4  40  41  42  44  45  46  47  49  43  48
5  50  51  52  54  55  56  57  59  53  58
6  60  61  62  64  65  66  67  69  63  68
7  70  71  72  74  75  76  77  79  73  78
8  80  81  82  84  85  86  87  89  83  88
9  90  91  92  94  95  96  97  99  93  98

In [105]:
test.assign()

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [107]:
price_dict = {'AMZN':{'Closing price': 2039.51,
                      'EPS': 12.63,
                      'Shares Outstanding(M)': 487.74,
                      'Beta': 1.61,
                      'P/E': 157.98,
                      'Market Cap(B)': 972.96},
             'FB':   {'Closing price': 171.16,
                      'EPS': 6.46,
                      'Shares Outstanding(M)': 2398.61,
                      'Beta': 0.66,
                      'P/E': 25.87,
                      'Market Cap(B)': 482.68},
             'GOOG': {'Closing price': 1197,
                      'EPS': 23.16,
                      'Shares Outstanding(M)': 348.95,
                      'Beta': 1.4,
                      'P/E': 51.38,
                      'Market Cap(B)': 829.37}}

In [108]:
pd.DataFrame(price_dict)

                          AMZN       FB     GOOG
Beta                      1.61     0.66     1.40
Closing price          2039.51   171.16  1197.00
EPS                      12.63     6.46    23.16
Market Cap(B)           972.96   482.68   829.37
P/E                     157.98    25.87    51.38
Shares Outstanding(M)   487.74  2398.61   348.95

In [114]:
pd.DataFrame(data=[price_dict['AMZN'],price_dict['FB'],price_dict['GOOG']],
             index=price_dict.keys()).T

                          AMZN       FB     GOOG
Beta                      1.61     0.66     1.40
Closing price          2039.51   171.16  1197.00
EPS                      12.63     6.46    23.16
Market Cap(B)           972.96   482.68   829.37
P/E                     157.98    25.87    51.38
Shares Outstanding(M)   487.74  2398.61   348.95